src/Catalogs/Scan_КонтактныеЛица/Scan_КонтактныеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_КонтактныеЛица</name>
  <owners>Catalog.Scan_Контрагенты</owners>
  <owners>Catalog.Scan_Компании</owners>
  <owners>Catalog.Scan_Сотрудники</owners>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтактногоЛица</name>
    <type>
      <types>EnumRef.Scan_ВидыКонтактныхЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДилерскаяСтанция</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Scan_Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <comment>Контактное лицо больше не используется в программе, но сведения о нем сохранены. Недействительные контактные лица скрываются из всех списков при выборе или подборе в документах, и других местах программы.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьДетализированныйАкт</name>
    <comment>#15689</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьПисьмаНапоминанияПоДоставкеИзделий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьПисьмаНапоминанияПоДоставкеИзделийПовторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьПисьмаОбОтклоненияхПоКлючевымДатамЗаказовНаЗавод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьПисьмоСОтчетомDeliveriesReport</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьПФЗаявкиНаДействие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьПФЗаявкиНаСервисныеРаботы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьПФЗаявкиПеревозчику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьПФМ15</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьПФМХ1МХ3</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьПФМХ3</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьЧекЛистПроверкиТехсостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/Scan_ВзаимосвязьКонтактныхЛицИМестХранения/Scan_ВзаимосвязьКонтактныхЛицИМестХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ВзаимосвязьКонтактныхЛицИМестХранения</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступностьВПФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.Scan_КонтактныеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Scan_КонтактныеЛица/ObjectModule.bsl
//rarus sergei 09.11.2016 mantis 7163 ++
Процедура ПередЗаписью(Отказ)
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ?(ЭтотОбъект.ЭтоНовый(), ИСТИНА, ЛОЖЬ));
	//rarus abrant 16.11.2017 mantis 12037 +++
	Если Недействителен Тогда
		ОтправлятьПисьмаНапоминанияПоДоставкеИзделий = Ложь;
		ОтправлятьПФМ15 = Ложь;
		ОтправлятьПФЗаявкиНаДействие = Ложь;
		ОтправлятьПисьмаНапоминанияПоДоставкеИзделийПовторно = Ложь;
		ОтправлятьПФЗаявкиПеревозчику = Ложь;
		ОтправлятьПФМХ1МХ3 = Ложь;
		ОтправлятьПФМХ3 = Ложь;
		//rarus pechek 03.04.2020 mantis 15672 +++
		//Если ЗначениеЗаполнено(Ссылка) И НЕ Ссылка.Недействителен Тогда
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = 
		//		"ВЫБРАТЬ
		//		|	Scan_ДоговорыВзаиморасчетовКонтактныеЛицаПоДоговору.Ссылка КАК Ссылка
		//		|ИЗ
		//		|	Справочник.Scan_ДоговорыВзаиморасчетов.КонтактныеЛицаПоДоговору КАК Scan_ДоговорыВзаиморасчетовКонтактныеЛицаПоДоговору
		//		|ГДЕ
		//		|	Scan_ДоговорыВзаиморасчетовКонтактныеЛицаПоДоговору.КонтактноеЛицо = &КонтактноеЛицо
		//		|
		//		|СГРУППИРОВАТЬ ПО
		//		|	Scan_ДоговорыВзаиморасчетовКонтактныеЛицаПоДоговору.Ссылка";
		//	
		//	Запрос.УстановитьПараметр("КонтактноеЛицо", Ссылка);
		//	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();			
		//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//		ДоговорОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		//		Для каждого КЛ из ДоговорОбъект.КонтактныеЛицаПоДоговору Цикл
		//			Если КЛ.КонтактноеЛицо = Ссылка Тогда
		//				ДоговорОбъект.КонтактныеЛицаПоДоговору.Удалить(КЛ);
		//			КонецЕсли;
		//		КонецЦикла;
		//		ДоговорОбъект.Записать();
		//	КонецЦикла;
		//КонецЕсли;
		//rarus pechek 03.04.2020 mantis 15672 ---
		
		//rarus tenkam 18.08.2020 mantis 16386 +++
		ОтправлятьЧекЛистПроверкиТехсостояния = Ложь;
		ОтправлятьПФЗаявкиНаСервисныеРаботы = Ложь;
		ОтправлятьПисьмаОбОтклоненияхПоКлючевымДатамЗаказовНаЗавод = Ложь;
		ОтправлятьПисьмоСОтчетомDeliveriesReport = Ложь;
		
		МассивМестХранения = Новый Массив; // Rarus tenkam 10.02.2022 mantis 18840 +
		
		Если ЗначениеЗаполнено(Ссылка) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Scan_ВзаимосвязьКонтактныхЛицИМестХранения.МестоХранения КАК МестоХранения,
			|	Scan_ВзаимосвязьКонтактныхЛицИМестХранения.КонтактноеЛицо КАК КонтактноеЛицо
			|ИЗ
			|	РегистрСведений.Scan_ВзаимосвязьКонтактныхЛицИМестХранения КАК Scan_ВзаимосвязьКонтактныхЛицИМестХранения
			|ГДЕ
			|	Scan_ВзаимосвязьКонтактныхЛицИМестХранения.КонтактноеЛицо = &КонтактноеЛицо";
			
			Запрос.УстановитьПараметр("КонтактноеЛицо", Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				НаборЗаписей = РегистрыСведений.Scan_ВзаимосвязьКонтактныхЛицИМестХранения.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.МестоХранения.Установить(ВыборкаДетальныеЗаписи.МестоХранения);
				НаборЗаписей.Отбор.КонтактноеЛицо.Установить(Ссылка);    		
				
				НаборЗаписей.Записать(); 
				
				МассивМестХранения.Добавить(ВыборкаДетальныеЗаписи.МестоХранения); // Rarus tenkam 10.02.2022 mantis 18840 +
			КонецЦикла;
			
			// Rarus tenkam 10.02.2022 mantis 18840 +++
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Scan_МестаХранения.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ СкорректированныеМестаХранения
			|ИЗ
			|	Справочник.Scan_МестаХранения КАК Scan_МестаХранения
			|ГДЕ
			|	Scan_МестаХранения.Ссылка В(&МассивМестХранения)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СкорректированныеМестаХранения.Ссылка КАК Ссылка,
			|	Scan_ВзаимосвязьКонтактныхЛицИМестХранения.КонтактноеЛицо КАК КонтактноеЛицо
			|ПОМЕСТИТЬ МестаИКЛ
			|ИЗ
			|	СкорректированныеМестаХранения КАК СкорректированныеМестаХранения
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_ВзаимосвязьКонтактныхЛицИМестХранения КАК Scan_ВзаимосвязьКонтактныхЛицИМестХранения
			|		ПО СкорректированныеМестаХранения.Ссылка = Scan_ВзаимосвязьКонтактныхЛицИМестХранения.МестоХранения
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МестаИКЛ.Ссылка КАК МестоХранения
			|ИЗ
			|	МестаИКЛ КАК МестаИКЛ
			|ГДЕ
			|	МестаИКЛ.КонтактноеЛицо ЕСТЬ NULL";
			
			Запрос.УстановитьПараметр("МассивМестХранения", МассивМестХранения);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если НЕ РезультатЗапроса.Пустой() Тогда
				// Отправим письмо
				СписокМестХранения = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("МестоХранения");
				РезультатОтправкиПисьма = Scan_ОтправкаПисемПоЭлектроннойПочте.ОтправитьПисьмоПоШаблонуИзПрава("ШаблонПисьмаОПоявленииМестХраненияБезАктивныхКЛ", СписокМестХранения); 
			КонецЕсли;
						
			// Rarus tenkam 10.02.2022 mantis 18840 ---
		КонецЕсли;
		//rarus tenkam 18.08.2020 mantis 16386 ---
		
	КонецЕсли;
	//rarus abrant 16.11.2017 mantis 12037 ---
КонецПроцедуры
//rarus sergei 09.11.2016 mantis 7163 --
